In [1]:
!pip install pandas


import numpy as np
import pandas as pd
import os
heroes_information = pd.read_csv("heroes_information.csv")

Requirement already satisfied: pandas in c:\users\barri\anaconda\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\barri\anaconda\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\barri\anaconda\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\barri\anaconda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\barri\anaconda\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\barri\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
###instalar desde anaconda navigator######
####pandasql
####mysql
####mysql-connector-c
####mysql-connector-python

!pip install pandasql

import pandasql as psql

Requirement already satisfied: pandasql in c:\users\barri\anaconda\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\barri\anaconda\lib\site-packages (from pandasql) (1.26.4)
Requirement already satisfied: pandas in c:\users\barri\anaconda\lib\site-packages (from pandasql) (2.2.2)
Requirement already satisfied: sqlalchemy in c:\users\barri\anaconda\lib\site-packages (from pandasql) (2.0.30)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\barri\anaconda\lib\site-packages (from pandas->pandasql) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\barri\anaconda\lib\site-packages (from pandas->pandasql) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\barri\anaconda\lib\site-packages (from pandas->pandasql) (2023.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\barri\anaconda\lib\site-packages (from sqlalchemy->pandasql) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\barri\anaconda\lib\site-packages (from sqlalchemy->pandasql) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\users\barri\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas->pandasql) (1.16.0)

In [3]:
####para enlistar los documentos en el directorio#####
os.listdir()

['.ipynb_checkpoints', 'heroes_information.csv', 'SQL Competition.ipynb']

In [4]:
pysqldf = lambda q: psql.sqldf(q, globals())

In [15]:
query1 = """
SELECT name
FROM heroes_information
ORDER BY name ASC
LIMIT 1;
"""

result = pysqldf(query1)
print(result)

     name
0  A-Bomb

In [17]:
query2 = """
SELECT COUNT(DISTINCT "Publisher") as num_publishers
FROM heroes_information;
"""

pysqldf(query2)

   num_publishers
0              24

In [21]:
query3 = """
SELECT COUNT(*) as num_heroes
FROM heroes_information
WHERE Height > 200;
"""

pysqldf(query3)

   num_heroes
0          59

In [23]:
query5 = """
SELECT COUNT(*) as num_heroes
FROM heroes_information
WHERE Weight > 100 AND Weight < 200;
"""

pysqldf(query5)

   num_heroes
0          98

In [35]:
query6 = """
SELECT COUNT(*) as num_heroes
FROM heroes_information
WHERE "Eye color" = 'Blue' OR "Eye color" = 'Red';
"""

pysqldf(query6)

   num_heroes
0           0

In [39]:
query7 = """
SELECT COUNT(*) as num_heroes
FROM heroes_information
WHERE 
    ("Race" = 'Human' OR "Race" = 'Mutant') AND "HairColor" = 'Green'
    OR ("Race" = 'Vampire' AND "HairColor" = 'Black');
"""

pysqldf(query7)

   num_heroes
0           0

In [41]:
query8 = """
SELECT name
FROM heroes_information
ORDER BY "Race" DESC
LIMIT 1;
"""

pysqldf(query8)

             name
0  Solomon Grundy

In [43]:
query9 = """
SELECT "Gender", COUNT(*) as num_heroes
FROM heroes_information
WHERE "Gender" IN ('Male', 'Female')
GROUP BY "Gender";
"""

pysqldf(query9)

   Gender  num_heroes
0  Female         200
1    Male         505

In [47]:
query10 = """
SELECT COUNT(*) as num_publishers
FROM (
    SELECT "Publisher", COUNT(*) as num_heroes
    FROM heroes_information
    GROUP BY "Publisher"
    HAVING COUNT(*) > 15
) as subquery;
"""

pysqldf(query10)

   num_publishers
0               4